# Project Diana Eger

Загрузим библиотеку Пандас и базу данных для дальнейшей работы

In [214]:
import pandas as pd
data = pd.read_csv('data2.csv')
data

         Country          Sex  2016  2015  2010  2000
0    Afghanistan   Both sexes   6.4   6.6   7.4   8.1
1    Afghanistan         Male  10.6  10.9  12.5  14.3
2    Afghanistan       Female   2.1   2.1   2.1   1.7
3        Albania   Both sexes   5.6   5.3   7.7   5.8
4        Albania         Male   7.0   6.7   9.5   8.2
..           ...          ...   ...   ...   ...   ...
544       Zambia         Male  17.5  17.4  17.9  21.9
545       Zambia       Female   6.2   6.1   6.2   7.5
546     Zimbabwe   Both sexes  19.1  18.9  20.6  21.7
547     Zimbabwe         Male  29.1  28.7  32.3  35.5
548     Zimbabwe       Female  11.1  11.1  11.1   9.8

[549 rows x 6 columns]

Для удобства переименуем названия колонок на русский

In [215]:
data.rename(columns = {'Country':'Страна',
                      'Sex':'Пол'}, inplace = True)
data.head()

        Страна          Пол  2016  2015  2010  2000
0  Afghanistan   Both sexes   6.4   6.6   7.4   8.1
1  Afghanistan         Male  10.6  10.9  12.5  14.3
2  Afghanistan       Female   2.1   2.1   2.1   1.7
3      Albania   Both sexes   5.6   5.3   7.7   5.8
4      Albania         Male   7.0   6.7   9.5   8.2

Находим отклонение

In [216]:
import time
start_time = time.time()
print(start_time)
column = '2000'

print(f'Столбец {column} имеет среднеквадратичное отклонение равное {data[column].std()}')

run_time = time.time() - start_time
print(run_time)

1666896920.164994
Столбец 2000 имеет среднеквадратичное отклонение равное 10.37831849105209
0.0023260116577148438

Находим крайние значения для самоубийств в 2000 году

In [217]:
data['2000'].max()

85.8

In [218]:
data['2000'].min()

0.1

Находим соотношение между значениями

In [219]:
data['2000'].sort_values()

14      0.1
41      0.5
32      0.7
248     0.8
479     0.8
       ...
511    58.1
256    63.1
43     70.4
289    81.7
406    85.8
Name: 2000, Length: 549, dtype: float64

In [220]:
data['2000'].mean()

12.164116575591983

Выводим всевозможные соотношения за разные годы

In [221]:
data['2000'].describe()

count    549.000000
mean      12.164117
std       10.378318
min        0.100000
25%        5.100000
50%        9.500000
75%       16.000000
max       85.800000
Name: 2000, dtype: float64

In [222]:
import time
start_time = time.time()
print(start_time)
column = '2010'

print(f'Столбец {column} имеет среднеквадратичное отклонение равное {data[column].std()}')

run_time = time.time() - start_time
print(run_time)

1666896920.271154
Столбец 2010 имеет среднеквадратичное отклонение равное 8.62017438526615
0.002666950225830078

In [223]:
data['2010'].max()

62.3

In [224]:
data['2010'].min()

0.0

In [225]:
data['2010'].mean()

10.544990892531876

In [226]:
data['2010'].sort_values()

14      0.0
200     0.0
12      0.2
13      0.5
197     0.6
       ...
211    44.9
256    56.1
289    56.4
43     58.1
406    62.3
Name: 2010, Length: 549, dtype: float64

In [227]:
data['2010'].describe()

count    549.000000
mean      10.544991
std        8.620174
min        0.000000
25%        4.700000
50%        8.400000
75%       14.100000
max       62.300000
Name: 2010, dtype: float64

In [228]:
import time
start_time = time.time()
print(start_time)
column = '2015'

print(f'Столбец {column} имеет среднеквадратичное отклонение равное {data[column].std()}')

run_time = time.time() - start_time
print(run_time)

1666896920.415458
Столбец 2015 имеет среднеквадратичное отклонение равное 7.633240774676459
0.0029439926147460938

In [229]:
data['2015'].max()

51.5

In [230]:
data['2015'].min()

0.0

In [231]:
data['2015'].mean()

9.925683060109286

In [232]:
data['2015'].sort_values()

13      0.0
41      0.3
39      0.4
32      0.5
200     0.6
       ...
43     39.2
256    44.2
211    46.6
406    49.9
289    51.5
Name: 2015, Length: 549, dtype: float64

In [233]:
data['2015'].describe()

count    549.000000
mean       9.925683
std        7.633241
min        0.000000
25%        4.400000
50%        8.100000
75%       13.300000
max       51.500000
Name: 2015, dtype: float64

In [234]:
import time
start_time = time.time()
print(start_time)
column = '2016'

print(f'Столбец {column} имеет среднеквадратичное отклонение равное {data[column].std()}')

run_time = time.time() - start_time
print(run_time)

1666896920.567713
Столбец 2016 имеет среднеквадратичное отклонение равное 7.469341153276958
0.001856088638305664

In [235]:
data['2016'].max()

48.3

In [236]:
data['2016'].min()

0.0

In [237]:
data['2016'].mean()

9.792531876138423

In [238]:
data['2016'].sort_values()

13      0.0
41      0.3
39      0.4
32      0.5
12      0.5
       ...
43     39.3
256    40.1
211    46.6
289    47.5
406    48.3
Name: 2016, Length: 549, dtype: float64

In [239]:
data['2016'].describe()

count    549.000000
mean       9.792532
std        7.469341
min        0.000000
25%        4.300000
50%        7.900000
75%       13.400000
max       48.300000
Name: 2016, dtype: float64

Узнаем тип данных для последующих сравнений

In [240]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 549 entries, 0 to 548
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Страна  549 non-null    object
 1   Пол     549 non-null    object
 2   2016    549 non-null    float64
 3   2015    549 non-null    float64
 4   2010    549 non-null    float64
 5   2000    549 non-null    float64
dtypes: float64(4), object(2)
memory usage: 25.9+ KB

Выводим процентное соотношение самоубийств по странам в разные годы

In [241]:
data.groupby('Страна')['2000'].mean().to_frame()

                                         2000
Страна
Afghanistan                          8.033333
Albania                              5.866667
Algeria                              4.733333
Angola                              14.333333
Antigua and Barbuda                  2.166667
...                                       ...
Venezuela (Bolivarian Republic of)   9.200000
Viet Nam                             7.633333
Yemen                                9.133333
Zambia                              14.500000
Zimbabwe                            22.333333

[183 rows x 1 columns]

In [242]:
data.groupby('Страна')['2010'].mean().to_frame()

                                         2010
Страна
Afghanistan                          7.333333
Albania                              7.733333
Algeria                              3.500000
Angola                              10.733333
Antigua and Barbuda                  0.233333
...                                       ...
Venezuela (Bolivarian Republic of)   4.566667
Viet Nam                             7.200000
Yemen                               10.600000
Zambia                              11.866667
Zimbabwe                            21.333333

[183 rows x 1 columns]

In [243]:
data.groupby('Страна')['2015'].mean().to_frame()

                                         2015
Страна
Afghanistan                          6.533333
Albania                              5.333333
Algeria                              3.400000
Angola                               9.600000
Antigua and Barbuda                  0.800000
...                                       ...
Venezuela (Bolivarian Republic of)   3.966667
Viet Nam                             7.133333
Yemen                                9.933333
Zambia                              11.566667
Zimbabwe                            19.566667

[183 rows x 1 columns]

In [244]:
data.groupby('Страна')['2016'].mean().to_frame()

                                         2016
Страна
Afghanistan                          6.366667
Albania                              5.633333
Algeria                              3.333333
Angola                               9.166667
Antigua and Barbuda                  0.466667
...                                       ...
Venezuela (Bolivarian Republic of)   3.866667
Viet Nam                             7.066667
Yemen                                9.800000
Zambia                              11.666667
Zimbabwe                            19.766667

[183 rows x 1 columns]

Выводим процентное соотношение самоубийств по гендерному признаку в разные годы

In [245]:
data.groupby('Пол')['2000'].mean().to_frame()

                  2000
Пол
 Both sexes  11.996721
 Female       6.368306
 Male        18.127322

In [246]:
data.groupby('Пол')['2010'].mean().to_frame()

                  2010
Пол
 Both sexes  10.414754
 Female       5.481421
 Male        15.738798

In [247]:
data.groupby('Пол')['2015'].mean().to_frame()

                  2015
Пол
 Both sexes   9.807104
 Female       5.192350
 Male        14.777596

In [248]:
data.groupby('Пол')['2016'].mean().to_frame()

                  2016
Пол
 Both sexes   9.682514
 Female       5.092896
 Male        14.602186

## Страны с максимальным процентом суицида за год

In [249]:
data.loc[data[data['2000'] == data['2000'].max()].index, 'Страна']

406    Russian Federation
Name: Страна, dtype: object

In [250]:
data.loc[data[data['2010'] == data['2010'].max()].index, 'Страна']

406    Russian Federation
Name: Страна, dtype: object

In [251]:
data.loc[data[data['2015'] == data['2015'].max()].index, 'Страна']

289    Lithuania
Name: Страна, dtype: object

In [252]:
data.loc[data[data['2016'] == data['2016'].max()].index, 'Страна']

406    Russian Federation
Name: Страна, dtype: object

## Страны с минимальным процентом суицида за год

In [253]:
data.loc[data[data['2000'] == data['2000'].min()].index, 'Страна']

14    Antigua and Barbuda
Name: Страна, dtype: object

In [254]:
data.loc[data[data['2010'] == data['2010'].min()].index, 'Страна']

14     Antigua and Barbuda
200                Grenada
Name: Страна, dtype: object

In [255]:
data.loc[data[data['2015'] == data['2015'].min()].index, 'Страна']

13    Antigua and Barbuda
Name: Страна, dtype: object

In [256]:
data.loc[data[data['2016'] == data['2016'].min()].index, 'Страна']

13    Antigua and Barbuda
Name: Страна, dtype: object

## Максимальный процент суицида за год среди мужчин и женщин

In [257]:
data.loc[data[data['2000'] == data['2000'].max()].index, 'Пол']

406     Male
Name: Пол, dtype: object

In [258]:
data.loc[data[data['2010'] == data['2010'].max()].index, 'Пол']

406     Male
Name: Пол, dtype: object

In [259]:
data.loc[data[data['2015'] == data['2015'].max()].index, 'Пол']

289     Male
Name: Пол, dtype: object

In [260]:
data.loc[data[data['2016'] == data['2016'].max()].index, 'Пол']

406     Male
Name: Пол, dtype: object

## Минимальный процент суицида за год среди мужчин и женщин

In [261]:
data.loc[data[data['2000'] == data['2000'].min()].index, 'Пол']

14     Female
Name: Пол, dtype: object

In [262]:
data.loc[data[data['2010'] == data['2010'].min()].index, 'Пол']

14      Female
200     Female
Name: Пол, dtype: object

In [263]:
data.loc[data[data['2015'] == data['2015'].min()].index, 'Пол']

13     Male
Name: Пол, dtype: object

In [264]:
data.loc[data[data['2016'] == data['2016'].min()].index, 'Пол']

13     Male
Name: Пол, dtype: object

In [265]:
import numpy as np
summ = pd.DataFrame(np.array([[2000, int(data['2000'].sum())],
                                   [2010, int(data['2010'].sum())],
                                   [2015, int(data['2015'].sum())],
                                   [2016, int(data['2016'].sum())]]),
                         columns=['Год', 'Кол-во суицидов'])
summ

    Год  Кол-во суицидов
0  2000             6678
1  2010             5789
2  2015             5449
3  2016             5376